ByDesignAPIClientSolution/ByDesignSoapClient.Api/xmlfiles/salesOrder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:glob="http://sap.com/xi/SAPGlobal20/Global" xmlns:glob1="http://sap.com/xi/AP/Globalization">
  <soapenv:Header />
  <soapenv:Body>
    <glob:SalesOrderBundleMaintainRequest_sync>
      <BasicMessageHeader />
      <SalesOrder>
<ObjectNodeSenderTechnicalID>S0355</ObjectNodeSenderTechnicalID><BuyerID>S0355</BuyerID><PostingDate>2019-08-10T00:00:00Z</PostingDate><Name>Sales for august to John</Name><DataOriginTypeCode>4</DataOriginTypeCode><AccountParty><PartyID>1000165</PartyID></AccountParty><BillToParty><PartyID>1000165</PartyID></BillToParty><SalesUnitParty><PartyID>G1100</PartyID></SalesUnitParty><SalesAndServiceBusinessArea><DistributionChannelCode>01</DistributionChannelCode></SalesAndServiceBusinessArea><EmployeeResponsibleParty><PartyID>7000000</PartyID></EmployeeResponsibleParty><RequestedFulfillmentPeriodPeriodTerms><StartDateTime timeZoneCode="UTC+1">2019-08-10T00:00:00Z</StartDateTime><EndDateTime /></RequestedFulfillmentPeriodPeriodTerms><DeliveryTerms><DeliveryPriorityCode>3</DeliveryPriorityCode></DeliveryTerms><PricingTerms><GrossAmountIndicator>false</GrossAmountIndicator></PricingTerms><Item><ID>10</ID><ProcessingTypeCode>TAN</ProcessingTypeCode><ItemProduct><ProductID>106462</ProductID></ItemProduct><ItemScheduleLine><Quantity unitCode="XCT">200</Quantity></ItemScheduleLine><ShipFromItemLocation><LocationID>G2000</LocationID></ShipFromItemLocation><PriceAndTaxCalculationItem><TaxationCharacteristicsCode listID="1">300</TaxationCharacteristicsCode></PriceAndTaxCalculationItem></Item><Item><ID>20</ID><ProcessingTypeCode>TAN</ProcessingTypeCode><ItemProduct><ProductID>106747</ProductID></ItemProduct><ItemScheduleLine><Quantity unitCode="XCT">300</Quantity></ItemScheduleLine><ShipFromItemLocation><LocationID>G2000</LocationID></ShipFromItemLocation><PriceAndTaxCalculationItem><TaxationCharacteristicsCode listID="1">300</TaxationCharacteristicsCode></PriceAndTaxCalculationItem></Item>
</SalesOrder>
</glob:SalesOrderBundleMaintainRequest_sync>
  </soapenv:Body>
</soapenv:Envelope>